In [1]:
import pandas as pd
import numpy as np

# Einlesen von json_index Files

In [9]:
pd.read_json("people_index.json")

           0     1        2        3        4
Name   Alyse  John  Octavia  Gonzalo  Chasity
Age       30    14       22       27       29
Score      4     9        4       10        1

# Einlesen von json_records Files

In [3]:
pd.read_json("people_records.json")

      Name  Age  Score
0    Alyse   30      4
1     John   14      9
2  Octavia   22      4
3  Gonzalo   27     10
4  Chasity   29      1

# Einlesen von json_split Files

In [4]:
pd.read_json("people_split.json", orient="split")

      Name  Age  Score
0    Alyse   30      4
1     John   14      9
2  Octavia   22      4
3  Gonzalo   27     10
4  Chasity   29      1

# Einlesen von json_values Files

In [5]:
pd.read_json("people_values.json")

         0   1   2
0    Alyse  30   4
1     John  14   9
2  Octavia  22   4
3  Gonzalo  27  10
4  Chasity  29   1

# Einlesen von json_columns Files

In [6]:
pd.read_json("people_columns.json")

      Name  Age  Score
0    Alyse   30      4
1     John   14      9
2  Octavia   22      4
3  Gonzalo   27     10
4  Chasity   29      1